#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
int main()
{
	int arr[] = {33,35,37, 39, 41, 44, 47, 49, 52, 56, 58, 60, 
		63, 66, 70, 73, 76, 79, 83, 87, 91, 94, 97, 101, 105, 108,
		111, 114, 117, 121, 124, 127, 131, 135, 139, 143, 146, 150, 
		154, 158, 162, 166, 170, 174, 178, 182, 186, 190, 194, 198,
		202, 207, 210, 214, 218, 222, 226, 230, 235, 239, 243, 247,
		251, 255, 260, 264, 268, 273, 277, 281, 286, 290, 295, 299,
		304, 308, 313, 317, 322, 326, 331, 335, 340, 345, 349, 354,
		359, 363, 368, 373, 378, 382, 387, 392, 396, 401, 406, 410,
		415};
	int j;
	scanf("%d", &j);
	int right = sizeof(arr) / sizeof(arr[0])-1;
	int left = 0;
	int i = (left + right) / 2;
	while (arr[i] != j && left<=right)
	{
		i = (left + right) / 2;
		if (arr[i] < j)
		{
			left = i + 1;
		}
		else if (arr[i] > j)
		{
			right = i - 1;
		}
	}
	if (left >right)
	{
		printf("数组中不存在值为%d的数组元素", j);
	}
	else
	{
		printf("值为%d的数组元素下标为%d\n", j, i);
	}
		return 0;
}